prielhoffman/STM32_Smart_Plant_Monitor/Firmware/Src/main.c
    FIL file;
    FRESULT result;
    UINT bytes_written = 0U;
    char csv_line[180];

    if (is_filesystem_mounted == 0U)
    {
        UART_Log("[FS] Mounting filesystem for CSV\r\n");

        result = f_mount(&fs, "", 1U);

        if (result != FR_OK)
        {
            char log_buffer[60];

            snprintf(log_buffer,
                     sizeof(log_buffer),
                     "[FS] CSV mount failed, error=%d\r\n",
                     result);

            UART_Log(log_buffer);
            return;
        }

        is_filesystem_mounted = 1U;
        UART_Log("[FS] Filesystem mounted for CSV\r\n");
    }

    result = f_open(&file, PLANT_LOG_FILE_NAME, FA_OPEN_ALWAYS | FA_WRITE);

    if (result != FR_OK)
    {
        char log_buffer[60];

        snprintf(log_buffer,
                 sizeof(log_buffer),
                 "[FS] CSV open failed, error=%d\r\n",
                 result);

        UART_Log(log_buffer);
        return;
    }

    if (f_size(&file) == 0U)
    {
        const char csv_header[] =
            "timestamp,soil_raw,soil_percent,light_raw,light_percent,temp_c,humidity_percent,status\r\n";

        result = f_write(&file,
                         csv_header,
                         sizeof(csv_header) - 1U,
                         &bytes_written);

        if ((result != FR_OK) || (bytes_written != (sizeof(csv_header) - 1U)))
        {
            UART_Log("[FS] CSV header write failed\r\n");
            f_close(&file);
            return;
        }

        UART_Log("[FS] CSV header written\r\n");
    }

    result = f_lseek(&file, f_size(&file));

    if (result != FR_OK)
    {
        UART_Log("[FS] CSV seek failed\r\n");
        f_close(&file);
        return;
    }

    snprintf(csv_line,
             sizeof(csv_line),
             "20%02u-%02u-%02u %02u:%02u:%02u,%u,%u,%u,%u,%ld.%02ld,%lu.%02lu,%s\r\n",
             g_plant_data.timestamp.year,
             g_plant_data.timestamp.month,
             g_plant_data.timestamp.date,
             g_plant_data.timestamp.hours,
             g_plant_data.timestamp.minutes,
             g_plant_data.timestamp.seconds,
             g_plant_data.soil_raw,
             g_plant_data.soil_percent,
             g_plant_data.light_raw,
             g_plant_data.light_percent,
             g_plant_data.air_temperature_c_x100 / 100,
             g_plant_data.air_temperature_c_x100 % 100,
             g_plant_data.air_humidity_percent_x100 / 100U,
             g_plant_data.air_humidity_percent_x100 % 100U,
             PlantStatus_ToString(g_plant_data.plant_status));

    result = f_write(&file,
                     csv_line,
                     strlen(csv_line),
                     &bytes_written);

    if ((result != FR_OK) || (bytes_written != strlen(csv_line)))
    {
        UART_Log("[FS] CSV data write failed\r\n");
        f_close(&file);
        return;
    }

    f_close(&file);

    UART_Log("[FS] Plant data logged to CSV\r\n");
}

int main(void){
	USART2_GPIO_Init();
    USART2_Debug_Init();

    AlertLEDs_GPIO_Init();
    UserButton_GPIO_Init();

    I2C1_GPIO_Init();
    I2C1_LCD_Init();

    LCD_Init(&g_i2c1_handle, LCD_I2C_ADDR);

    BME280_Application_Init();
    DS3231_Application_Init();
    SD_Card_Application_Init();

    ADC_GPIO_Init();
    ADC_Init();

    UART_Log("[ADC] ADC initialized and ready\r\n");

    g_current_state = SYSTEM_STATE_INIT;
    Log_CurrentState(g_current_state);

    g_current_state = SYSTEM_STATE_READ_SENSORS;

    while (1)
    {
    	Log_CurrentState(g_current_state);

        switch (g_current_state)
        {
            case SYSTEM_STATE_READ_SENSORS:
            	DS3231_ReadTimestamp();
            	g_plant_data.soil_raw = ADC_ReadChannel(ADC_CHANNEL_1);
            	g_plant_data.light_raw = ADC_ReadChannel(ADC_CHANNEL_0);
            	BME280_ReadEnvironment();

            	UART_Log("[SENSORS] Timestamp, soil, light and environment updated\r\n");

                g_current_state = SYSTEM_STATE_PROCESS_DATA;
                break;

            case SYSTEM_STATE_PROCESS_DATA:
            {
                g_plant_data.light_percent = ConvertRawToPercent(g_plant_data.light_raw, LIGHT_DARK_RAW, LIGHT_BRIGHT_RAW);
                g_plant_data.soil_percent = 100U - ConvertRawToPercent(g_plant_data.soil_raw, SOIL_WET_RAW, SOIL_DRY_RAW);

                g_plant_data.plant_status = PlantMonitor_CalculateStatus(&g_plant_data);
                UART_Log("[PROCESS] Plant status updated\r\n");

                g_current_state = SYSTEM_STATE_UPDATE_ALERTS;
                break;
            }

            case SYSTEM_STATE_UPDATE_ALERTS:
            	AlertLEDs_Update(g_plant_data.plant_status);

                UART_Log("[ALERT] Plant status = ");
                UART_Log(PlantStatus_ToString(g_plant_data.plant_status));
                UART_Log("\r\n");

                g_current_state = SYSTEM_STATE_UPDATE_DISPLAY;
                break;

            case SYSTEM_STATE_UPDATE_DISPLAY:
            	LCD_UpdateDisplay();

                UART_Log("[DISPLAY] LCD updated\r\n");

                g_current_state = SYSTEM_STATE_PRINT_LOG;
                break;

            case SYSTEM_STATE_PRINT_LOG:
            {
                char log_buffer[220];

                if (g_plant_data.rtc_is_available && g_plant_data.bme280_is_available){
                    snprintf(log_buffer,
                             sizeof(log_buffer),
                             "[LOG] 20%02u-%02u-%02u %02u:%02u:%02u | soil_raw=%u, soil=%u%%, light_raw=%u, light=%u%%, temp=%ld.%02ldC, hum=%lu.%02lu%%, status=%s\r\n",
                             g_plant_data.timestamp.year,
                             g_plant_data.timestamp.month,
                             g_plant_data.timestamp.date,
                             g_plant_data.timestamp.hours,
                             g_plant_data.timestamp.minutes,
                             g_plant_data.timestamp.seconds,
                             g_plant_data.soil_raw,
                             g_plant_data.soil_percent,
                             g_plant_data.light_raw,
                             g_plant_data.light_percent,
                             g_plant_data.air_temperature_c_x100 / 100,
                             g_plant_data.air_temperature_c_x100 % 100,
                             g_plant_data.air_humidity_percent_x100 / 100U,
                             g_plant_data.air_humidity_percent_x100 % 100U,
                             PlantStatus_ToString(g_plant_data.plant_status));
                }
                else if (g_plant_data.rtc_is_available){
                    snprintf(log_buffer,
                             sizeof(log_buffer),
                             "[LOG] 20%02u-%02u-%02u %02u:%02u:%02u | soil_raw=%u, soil=%u%%, light_raw=%u, light=%u%%, env=N/A, status=%s\r\n",
                             g_plant_data.timestamp.year,
                             g_plant_data.timestamp.month,
                             g_plant_data.timestamp.date,
                             g_plant_data.timestamp.hours,
                             g_plant_data.timestamp.minutes,
                             g_plant_data.timestamp.seconds,
                             g_plant_data.soil_raw,
                             g_plant_data.soil_percent,
                             g_plant_data.light_raw,
                             g_plant_data.light_percent,
                             PlantStatus_ToString(g_plant_data.plant_status));
                }
                else if (g_plant_data.bme280_is_available){
                    snprintf(log_buffer,
                             sizeof(log_buffer),
                             "[LOG] soil_raw=%u, soil=%u%%, light_raw=%u, light=%u%%, temp=%ld.%02ldC, hum=%lu.%02lu%%, status=%s\r\n",
                             g_plant_data.soil_raw,
                             g_plant_data.soil_percent,
                             g_plant_data.light_raw,
                             g_plant_data.light_percent,
                             g_plant_data.air_temperature_c_x100 / 100,
                             g_plant_data.air_temperature_c_x100 % 100,
                             g_plant_data.air_humidity_percent_x100 / 100U,
                             g_plant_data.air_humidity_percent_x100 % 100U,
                             PlantStatus_ToString(g_plant_data.plant_status));
                }
                else{
                    snprintf(log_buffer,
                             sizeof(log_buffer),
                             "[LOG] soil_raw=%u, soil=%u%%, light_raw=%u, light=%u%%, env=N/A, status=%s\r\n",
                             g_plant_data.soil_raw,
                             g_plant_data.soil_percent,
                             g_plant_data.light_raw,
                             g_plant_data.light_percent,
                             PlantStatus_ToString(g_plant_data.plant_status));
                }

                UART_Log(log_buffer);
                SD_LogPlantDataToCSV();
                g_current_state = SYSTEM_STATE_WAIT;
                break;
            }
            case SYSTEM_STATE_WAIT:
            {
                UART_Log("[WAIT] Waiting before next measurement cycle\r\n");

                for (uint8_t i = 0; i < 10U; i++){
                    LCD_HandlePageButton();
                    short_delay();
                }

                g_current_state = SYSTEM_STATE_READ_SENSORS;
                break;
            }

            default:
                g_current_state = SYSTEM_STATE_READ_SENSORS;
                break;
        }
    }
}
